Trisuborn/ART-PI_RT-Thread/thirdParty/rt-thread-all/bsp/stm32/libraries/HAL_Drivers/drv_spi.c
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2018-11-5      SummerGift   first version
 * 2018-12-11     greedyhao    Porting for stm32f7xx
 * 2019-01-03     zylx         modify DMA initialization and spixfer function
 * 2020-01-15     whj4674672   Porting for stm32h7xx
 * 2020-06-18     thread-liu   Porting for stm32mp1xx
 * 2020-10-14     Dozingfiretruck   Porting for stm32wbxx
 */

#include <rtthread.h>
#include <rtdevice.h>
#include "board.h"

#include "lcd_st7735.h"

#ifdef RT_USING_SPI

#if defined(BSP_USING_SPI1) || defined(BSP_USING_SPI2) || defined(BSP_USING_SPI3) || defined(BSP_USING_SPI4) || defined(BSP_USING_SPI5) || defined(BSP_USING_SPI6)

#include "drv_spi.h"
#include "drv_config.h"
#include <string.h>

//#define DRV_DEBUG
#define LOG_TAG              "drv.spi"
#include <drv_log.h>

enum {
#ifdef BSP_USING_SPI1
    SPI1_INDEX,
#endif
#ifdef BSP_USING_SPI2
    SPI2_INDEX,
#endif
#ifdef BSP_USING_SPI3
    SPI3_INDEX,
#endif
#ifdef BSP_USING_SPI4
    SPI4_INDEX,
#endif
#ifdef BSP_USING_SPI5
    SPI5_INDEX,
#endif
#ifdef BSP_USING_SPI6
    SPI6_INDEX,
#endif
};

static struct stm32_spi_config spi_config[] =
{
#ifdef BSP_USING_SPI1
    SPI1_BUS_CONFIG,
#endif

#ifdef BSP_USING_SPI2
    SPI2_BUS_CONFIG,
#endif

#ifdef BSP_USING_SPI3
    SPI3_BUS_CONFIG,
#endif

#ifdef BSP_USING_SPI4
    SPI4_BUS_CONFIG,
#endif

#ifdef BSP_USING_SPI5
    SPI5_BUS_CONFIG,
#endif

#ifdef BSP_USING_SPI6
    SPI6_BUS_CONFIG,
#endif
};

static struct stm32_spi spi_bus_obj[sizeof(spi_config) / sizeof(spi_config[0])] = { 0 };

static rt_err_t stm32_spi_init(struct stm32_spi* spi_drv, struct rt_spi_configuration* cfg)
{
    RT_ASSERT(spi_drv != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

    SPI_HandleTypeDef* spi_handle = &spi_drv->handle;

    if (cfg->mode & RT_SPI_SLAVE) {
        spi_handle->Init.Mode = SPI_MODE_SLAVE;
    } else {
        spi_handle->Init.Mode = SPI_MODE_MASTER;
    }

    if (cfg->mode & RT_SPI_3WIRE) {
        spi_handle->Init.Direction = SPI_DIRECTION_1LINE;
    } else {
        spi_handle->Init.Direction = SPI_DIRECTION_2LINES;
    }

    if (cfg->data_width == 8) {
        spi_handle->Init.DataSize = SPI_DATASIZE_8BIT;
        spi_handle->TxXferSize = 8;
        spi_handle->RxXferSize = 8;
    } else if (cfg->data_width == 16) {
        spi_handle->Init.DataSize = SPI_DATASIZE_16BIT;
    } else {
        return RT_EIO;
    }

    if (cfg->mode & RT_SPI_CPHA) {
        spi_handle->Init.CLKPhase = SPI_PHASE_2EDGE;
    } else {
        spi_handle->Init.CLKPhase = SPI_PHASE_1EDGE;
    }

    if (cfg->mode & RT_SPI_CPOL) {
        spi_handle->Init.CLKPolarity = SPI_POLARITY_HIGH;
    } else {
        spi_handle->Init.CLKPolarity = SPI_POLARITY_LOW;
    }

    if (cfg->mode & RT_SPI_NO_CS) {
        spi_handle->Init.NSS = SPI_NSS_HARD_OUTPUT;
    } else {
        spi_handle->Init.NSS = SPI_NSS_SOFT;
    }

    uint32_t SPI_PCLK;

    SPI_PCLK = HAL_RCC_GetPCLK2Freq();

    rt_kprintf("%d\n", cfg->max_hz);

    if (cfg->max_hz >= SPI_PCLK / 2) {
        spi_handle->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
        rt_kprintf("SPI_BAUDRATEPRESCALER_2\n");
    } else if (cfg->max_hz >= SPI_PCLK / 4) {
        spi_handle->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_4;
        rt_kprintf("SPI_BAUDRATEPRESCALER_4\n");
    } else if (cfg->max_hz >= SPI_PCLK / 8) {
        spi_handle->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_8;
        rt_kprintf("SPI_BAUDRATEPRESCALER_8\n");
    } else if (cfg->max_hz >= SPI_PCLK / 16) {
        spi_handle->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;
        rt_kprintf("SPI_BAUDRATEPRESCALER_16\n");
    } else if (cfg->max_hz >= SPI_PCLK / 32) {
        spi_handle->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_32;
        rt_kprintf("SPI_BAUDRATEPRESCALER_32\n");
    } else if (cfg->max_hz >= SPI_PCLK / 64) {
        spi_handle->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_64;
        rt_kprintf("SPI_BAUDRATEPRESCALER_64\n");
    } else if (cfg->max_hz >= SPI_PCLK / 128) {
        rt_kprintf("SPI_BAUDRATEPRESCALER_128\n");
        spi_handle->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_128;
    } else {
        /*  min prescaler 256 */
        rt_kprintf("SPI_BAUDRATEPRESCALER_256\n");
        spi_handle->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
    }

    LOG_D("sys freq: %d, pclk2 freq: %d, SPI limiting freq: %d, BaudRatePrescaler: %d",
#if defined(SOC_SERIES_STM32MP1)
        HAL_RCC_GetSystemCoreClockFreq(),
#else
        HAL_RCC_GetSysClockFreq(),
#endif
        SPI_PCLK,
        cfg->max_hz,
        spi_handle->Init.BaudRatePrescaler);

    if (cfg->mode & RT_SPI_MSB) {
        spi_handle->Init.FirstBit = SPI_FIRSTBIT_MSB;
    } else {
        spi_handle->Init.FirstBit = SPI_FIRSTBIT_LSB;
    }

    spi_handle->Init.TIMode = SPI_TIMODE_DISABLE;
    spi_handle->Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    spi_handle->State = HAL_SPI_STATE_RESET;
#if defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32G0) || defined(SOC_SERIES_STM32F0) || defined(SOC_SERIES_STM32WB)
    spi_handle->Init.NSSPMode = SPI_NSS_PULSE_DISABLE;
#elif defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32MP1)
    spi_handle->Init.Mode = SPI_MODE_MASTER;
    spi_handle->Init.NSS = SPI_NSS_SOFT;
    spi_handle->Init.NSSPMode = SPI_NSS_PULSE_DISABLE;
    spi_handle->Init.NSSPolarity = SPI_NSS_POLARITY_LOW;
    spi_handle->Init.CRCPolynomial = 7;
    spi_handle->Init.TxCRCInitializationPattern = SPI_CRC_INITIALIZATION_ALL_ZERO_PATTERN;
    spi_handle->Init.RxCRCInitializationPattern = SPI_CRC_INITIALIZATION_ALL_ZERO_PATTERN;
    spi_handle->Init.MasterSSIdleness = SPI_MASTER_SS_IDLENESS_00CYCLE;
    spi_handle->Init.MasterInterDataIdleness = SPI_MASTER_INTERDATA_IDLENESS_00CYCLE;
    spi_handle->Init.MasterReceiverAutoSusp = SPI_MASTER_RX_AUTOSUSP_DISABLE;
    spi_handle->Init.MasterKeepIOState = SPI_MASTER_KEEP_IO_STATE_ENABLE;
    spi_handle->Init.IOSwap = SPI_IO_SWAP_DISABLE;
    spi_handle->Init.FifoThreshold = SPI_FIFO_THRESHOLD_08DATA;
#endif

    if (HAL_SPI_Init(spi_handle) != HAL_OK) {
        return RT_EIO;
    }

#if defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32F0) \
        || defined(SOC_SERIES_STM32F7) || defined(SOC_SERIES_STM32G0) || defined(SOC_SERIES_STM32WB)
    SET_BIT(spi_handle->Instance->CR2, SPI_RXFIFO_THRESHOLD_HF);
#endif

    /* DMA configuration */
    if (spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG) {
        HAL_DMA_Init(&spi_drv->dma.handle_rx);

